[net]
batch=64
subdivisions=8
width=608
height=608
channels=3
momentum=0.949
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1
learning_rate=0.00261
burn_in=1000
max_batches=500500
policy=steps
steps=400000,450000
scales=.1,.1
mosaic=1

[focus]
filters=12

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=SiLU

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=SiLU

[shortcut]
from=-3
activation=linear

[route]
layers=-1,-6

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=SiLU

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=SiLU

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=SiLU

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=SiLU

[shortcut]
from=-3
activation=linear

[route]
layers=-1,-12

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=200
size=3
stride=2
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=88
size=1
stride=1
pad=1
activation=SiLU

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=48
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=SiLU

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=80
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=SiLU

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=72
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=SiLU

[shortcut]
from=-3
activation=linear

[route]
layers=-1,-12

[convolutional]
batch_normalize=1
filters=160
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=496
size=3
stride=2
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=SiLU

[maxpool]
stride=1
size=5

[route]
layers=-2

[maxpool]
stride=1
size=9

[route]
layers=-4

[maxpool]
stride=1
size=13

[route]
layers=-6,-5,-3,-1

[convolutional]
batch_normalize=1
filters=184
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=16
size=1
stride=1
pad=1
activation=SiLU

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=8
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=8
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=SiLU

[route]
layers=-1,-5

[convolutional]
batch_normalize=1
filters=80
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=SiLU

[upsample]
stride=2

[route]
layers=-1,-19

[convolutional]
batch_normalize=1
filters=80
size=1
stride=1
pad=1
activation=SiLU

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=56
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=56
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=120
size=3
stride=1
pad=1
activation=SiLU

[route]
layers=-1,-5

[convolutional]
batch_normalize=1
filters=152
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=SiLU

[upsample]
stride=2

[route]
layers=-1,-44

[convolutional]
batch_normalize=1
filters=48
size=1
stride=1
pad=1
activation=SiLU

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=56
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=56
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=SiLU

[route]
layers=-1,-5

[convolutional]
batch_normalize=1
filters=120
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear

[yolo]
mask=0,1,2
anchors=10,13, 16,30, 33,23, 30,61, 62,45, 59,119, 116,90, 156,198, 373,326
classes=1
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
scale_x_y=1.2
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6

[route]
layers=-3

[convolutional]
batch_normalize=1
filters=80
size=3
stride=2
pad=1
activation=SiLU

[route]
layers=-1,-14

[convolutional]
batch_normalize=1
filters=40
size=1
stride=1
pad=1
activation=SiLU

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=72
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=48
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=72
size=3
stride=1
pad=1
activation=SiLU

[route]
layers=-1,-5

[convolutional]
batch_normalize=1
filters=152
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear

[yolo]
mask=3,4,5
anchors=10,13, 16,30, 33,23, 30,61, 62,45, 59,119, 116,90, 156,198, 373,326
classes=1
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
scale_x_y=1.2
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6

[route]
layers=-3

[convolutional]
batch_normalize=1
filters=88
size=3
stride=2
pad=1
activation=SiLU

[route]
layers=-1,-36

[convolutional]
batch_normalize=1
filters=16
size=1
stride=1
pad=1
activation=SiLU

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
batch_normalize=1
filters=40
size=3
stride=1
pad=1
activation=SiLU

[route]
layers=-1,-5

[convolutional]
batch_normalize=1
filters=80
size=1
stride=1
pad=1
activation=SiLU

[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear

[yolo]
mask=6,7,8
anchors=10,13, 16,30, 33,23, 30,61, 62,45, 59,119, 116,90, 156,198, 373,326
classes=1
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
scale_x_y=1.2
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6

